---

<center><h1>Pandas Library in Pyhthon</h1></center>


- **Pandas:** Open source library for data manupulation analysis.

---
---

- We can read and write different formats of file like CSV, JSON, EXCEL, HTML, etc.
- We can summarize the data.
- We can filter and modify the data based on multiple conditions.
- We can merge multiple files.

In [1]:
# import the library 
import pandas as pd

***If you got an error while runing the above cell, import it by using following command.***


If you are using anaconda with pyhton3: ***`!pip install pandas`***

If you are using jupyter with python3: ***`!pip3 install pandas`***

---
---

In [2]:
# check the version of the pandas library
pd.__version__

'1.2.4'

In [4]:
# read the file
data = pd.read_csv("big_mart_sales.csv")

In [5]:
data

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
0,FDA15,9.300,Low Fat,0.016047,Dairy,249.8092,OUT049,1999,Medium,Tier 1,Supermarket Type1,3735.1380
1,DRC01,5.920,Regular,0.019278,Soft Drinks,48.2692,OUT018,2009,Medium,Tier 3,Supermarket Type2,443.4228
2,FDN15,17.500,Low Fat,0.016760,Meat,141.6180,OUT049,1999,Medium,Tier 1,Supermarket Type1,2097.2700
3,FDX07,19.200,Regular,0.000000,Fruits and Vegetables,182.0950,OUT010,1998,NaN,Tier 3,Grocery Store,732.3800
4,NCD19,8.930,Low Fat,0.000000,Household,53.8614,OUT013,1987,High,Tier 3,Supermarket Type1,994.7052
...,...,...,...,...,...,...,...,...,...,...,...,...
8518,FDF22,6.865,Low Fat,0.056783,Snack Foods,214.5218,OUT013,1987,High,Tier 3,Supermarket Type1,2778.3834
8519,FDS36,8.380,Regular,0.046982,Baking Goods,108.1570,OUT045,2002,NaN,Tier 2,Supermarket Type1,549.2850
8520,NCJ29,10.600,Low Fat,0.035186,Health and Hygiene,85.1224,OUT035,2004,Small,Tier 2,Supermarket Type1,1193.1136
8521,FDN46,7.210,Regular,0.145221,Snack Foods,103.1332,OUT018,2009,Medium,Tier 3,Supermarket Type2,1845.5976
8522,DRG01,14.800,Low Fat,0.044878,Soft Drinks,75.4670,OUT046,1997,Small,Tier 1,Supermarket Type1,765.6700

In [6]:
data.head(3)

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
0,FDA15,9.30,Low Fat,0.016047,Dairy,249.8092,OUT049,1999,Medium,Tier 1,Supermarket Type1,3735.1380
1,DRC01,5.92,Regular,0.019278,Soft Drinks,48.2692,OUT018,2009,Medium,Tier 3,Supermarket Type2,443.4228
2,FDN15,17.50,Low Fat,0.016760,Meat,141.6180,OUT049,1999,Medium,Tier 1,Supermarket Type1,2097.2700

In [7]:
#shape of the data
data.shape

(8523, 12)

In [9]:
#check the column names
data.columns

Index(['Item_Identifier', 'Item_Weight', 'Item_Fat_Content', 'Item_Visibility',
       'Item_Type', 'Item_MRP', 'Outlet_Identifier',
       'Outlet_Establishment_Year', 'Outlet_Size', 'Outlet_Location_Type',
       'Outlet_Type', 'Item_Outlet_Sales'],
      dtype='object')

In [10]:
# check the data type in the column
data.dtypess

Item_Identifier               object
Item_Weight                  float64
Item_Fat_Content              object
Item_Visibility              float64
Item_Type                     object
Item_MRP                     float64
Outlet_Identifier             object
Outlet_Establishment_Year      int64
Outlet_Size                   object
Outlet_Location_Type          object
Outlet_Type                   object
Item_Outlet_Sales            float64
dtype: object

In [11]:
# check null values in the data
data.isna().sum()

Item_Identifier                 0
Item_Weight                  1463
Item_Fat_Content                0
Item_Visibility                 0
Item_Type                       0
Item_MRP                        0
Outlet_Identifier               0
Outlet_Establishment_Year       0
Outlet_Size                  2410
Outlet_Location_Type            0
Outlet_Type                     0
Item_Outlet_Sales               0
dtype: int64

In [13]:
#summary of the data 
data.describe()

,Item_Weight,Item_Visibility,Item_MRP,Outlet_Establishment_Year,Item_Outlet_Sales
count,7060.000000,8523.000000,8523.000000,8523.000000,8523.000000
mean,12.857645,0.066132,140.992782,1997.831867,2181.288914
std,4.643456,0.051598,62.275067,8.371760,1706.499616
min,4.555000,0.000000,31.290000,1985.000000,33.290000
25%,8.773750,0.026989,93.826500,1987.000000,834.247400
50%,12.600000,0.053931,143.012800,1999.000000,1794.331000
75%,16.850000,0.094585,185.643700,2004.000000,3101.296400
max,21.350000,0.328391,266.888400,2009.000000,13086.964800

---

***Learn more about Pandas here:*** https://pandas.pydata.org/docs/

In [14]:
#Object creation
import numpy as np
import pandas as pd

In [16]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [23]:
# data frame creation: by passing a NumPy array, with a datetime index and labeled columns
date = pd.date_range("20211119", periods=6)
date

DatetimeIndex(['2021-11-19', '2021-11-20', '2021-11-21', '2021-11-22',
               '2021-11-23', '2021-11-24'],
              dtype='datetime64[ns]', freq='D')

In [25]:
df = pd.DataFrame(np.random.randn(6,4), index=date, columns=list("ABCD"))
df

                   A         B         C         D
2021-11-19 -0.650006  1.221463  1.198820  0.272767
2021-11-20 -0.347760  1.285186  0.023400 -0.712290
2021-11-21  0.363773 -0.905785  1.779158  0.352949
2021-11-22  0.326362 -0.441594 -0.012845 -1.209939
2021-11-23 -0.647395  0.045772  1.644106  1.837094
2021-11-24 -0.023108 -0.498163  1.491336  0.819827

In [33]:
# Creating a DataFrame by passing a dict of objects.
df2 = pd.DataFrame(
    {
        "A" : 1,
        "B" : pd.Timestamp("20130102"),
        "C" : pd.Series(1, index=list(range(4)), dtype="float32"),
        "D" : np.array([3]*4, dtype="int32"),
        "E" : pd.Categorical(["test", "train", "train", "test"]),
        "F" : "foo"
    }
)
df2

   A          B    C  D      E    F
0  1 2013-01-02  1.0  3   test  foo
1  1 2013-01-02  1.0  3  train  foo
2  1 2013-01-02  1.0  3  train  foo
3  1 2013-01-02  1.0  3   test  foo

In [50]:
df2.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [54]:
# viewing data top 2 rows
df2.head(2)

   A          B    C  D      E    F
0  1 2013-01-02  1.0  3   test  foo
1  1 2013-01-02  1.0  3  train  foo

In [55]:
#viewing datalast 2 rows
df2.tail(2)

   A          B    C  D      E    F
2  1 2013-01-02  1.0  3  train  foo
3  1 2013-01-02  1.0  3   test  foo

In [56]:
# display index, columns:
df.index

DatetimeIndex(['2021-11-19', '2021-11-20', '2021-11-21', '2021-11-22',
               '2021-11-23', '2021-11-24'],
              dtype='datetime64[ns]', freq='D')

In [57]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [58]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [59]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

***NumPy arrays have one dtype for the entire array, while pandas DataFrames have one dtype per column. When you call DataFrame.to_numpy(), pandas will find the NumPy dtype that can hold all of the dtypes in the DataFrame.***

In [61]:
df

                   A         B         C         D
2021-11-19 -0.650006  1.221463  1.198820  0.272767
2021-11-20 -0.347760  1.285186  0.023400 -0.712290
2021-11-21  0.363773 -0.905785  1.779158  0.352949
2021-11-22  0.326362 -0.441594 -0.012845 -1.209939
2021-11-23 -0.647395  0.045772  1.644106  1.837094
2021-11-24 -0.023108 -0.498163  1.491336  0.819827

In [60]:
df.to_numpy()

array([[-0.65000613,  1.22146298,  1.1988196 ,  0.27276669],
       [-0.34775989,  1.28518624,  0.02340003, -0.7122904 ],
       [ 0.36377312, -0.9057851 ,  1.77915838,  0.35294872],
       [ 0.32636232, -0.44159377, -0.01284474, -1.20993927],
       [-0.64739498,  0.04577213,  1.64410649,  1.83709427],
       [-0.02310779, -0.49816302,  1.49133586,  0.81982709]])

In [62]:
df2

   A          B    C  D      E    F
0  1 2013-01-02  1.0  3   test  foo
1  1 2013-01-02  1.0  3  train  foo
2  1 2013-01-02  1.0  3  train  foo
3  1 2013-01-02  1.0  3   test  foo

In [63]:
df2.to_numpy()

array([[1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo']],
      dtype=object)

In [64]:
# describe() shows a quick statistic summary of your data
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.163022  0.117813  1.020663  0.226735
std    0.456615  0.930173  0.809931  1.087094
min   -0.650006 -0.905785 -0.012845 -1.209939
25%   -0.572486 -0.484021  0.317255 -0.466026
50%   -0.185434 -0.197911  1.345078  0.312858
75%    0.238995  0.927540  1.605914  0.703107
max    0.363773  1.285186  1.779158  1.837094

In [65]:
#Transpsing a data
df.T

   2021-11-19  2021-11-20  2021-11-21  2021-11-22  2021-11-23  2021-11-24
A   -0.650006   -0.347760    0.363773    0.326362   -0.647395   -0.023108
B    1.221463    1.285186   -0.905785   -0.441594    0.045772   -0.498163
C    1.198820    0.023400    1.779158   -0.012845    1.644106    1.491336
D    0.272767   -0.712290    0.352949   -1.209939    1.837094    0.819827

In [66]:
#sort by axis
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2021-11-19  0.272767  1.198820  1.221463 -0.650006
2021-11-20 -0.712290  0.023400  1.285186 -0.347760
2021-11-21  0.352949  1.779158 -0.905785  0.363773
2021-11-22 -1.209939 -0.012845 -0.441594  0.326362
2021-11-23  1.837094  1.644106  0.045772 -0.647395
2021-11-24  0.819827  1.491336 -0.498163 -0.023108

In [70]:
#sort by value
df.sort_values(by="D")

                   A         B         C         D
2021-11-22  0.326362 -0.441594 -0.012845 -1.209939
2021-11-20 -0.347760  1.285186  0.023400 -0.712290
2021-11-19 -0.650006  1.221463  1.198820  0.272767
2021-11-21  0.363773 -0.905785  1.779158  0.352949
2021-11-24 -0.023108 -0.498163  1.491336  0.819827
2021-11-23 -0.647395  0.045772  1.644106  1.837094

In [71]:
# selecting data
df["A"]

2021-11-19   -0.650006
2021-11-20   -0.347760
2021-11-21    0.363773
2021-11-22    0.326362
2021-11-23   -0.647395
2021-11-24   -0.023108
Freq: D, Name: A, dtype: float64

In [72]:
df.A

2021-11-19   -0.650006
2021-11-20   -0.347760
2021-11-21    0.363773
2021-11-22    0.326362
2021-11-23   -0.647395
2021-11-24   -0.023108
Freq: D, Name: A, dtype: float64

In [73]:
#sliceing row
df[0:3]

                   A         B         C         D
2021-11-19 -0.650006  1.221463  1.198820  0.272767
2021-11-20 -0.347760  1.285186  0.023400 -0.712290
2021-11-21  0.363773 -0.905785  1.779158  0.352949